{
    "title": "Zscaler Interview Experience | On-Campus 2021",
    "lastUpdated": "16 November 2021",
    "experience": "<br>*INTRODUCTION*<br>Zscaler visited our campus in the month of September 2023 for the *Associate Software Engineer Role of C++ Developer (Intern + PPO). CSE, ECE, EE, Mathematics, and Computing* branches were allowed to sit in the process. (Around 600-700 students were eligible). The process started with a Zoom talk from HR and she explained about the online test which was going to be conducted on the Hackerrank platform after the talk. She made it clear not to copy the answers as the test will be done strictly. Then the test started which was of 130 minutes. It included 4 coding questions which were all of medium difficulty, with two of them being on the slightly easier side.Many were able to solve all 4 questions but did not get shortlisted due to the plag test. I was able to solve all 4 and moved on to the next round.After the online coding test, 27 students were shortlisted for interviews. The first rounds of interviews were held on the next day. The type of questions asked by the interviews ranged from interviewer to interviewer but were mostly focused on the *core CS Fundamentals.*<br><br>*My first round: * I was asked about online coding round experience and was asked to explain one of them, then questions from computer networks were asked including tcp/ip model, explain protocols of every layer, asked about session layer (why we need encryption), detailed explanation of DNS.I was able to give all answers comfortably and the interviewer was satisfied. The round lasted roughly 30 minutes with some general discussion about company in the end.11 students were shortlised for the 2nd round and I was one of them.<br><br>*My 2nd Round: *This round was a lot more technical and difficult than first round.I was asked my introduction and then asked about pointers in c++.Interviewer every detail about pointers in c++ there is including void pointers, size of pointers (depends on architecture), constant pointers, pointers to a constant, can we add values to pointer like (ptr +10, ptr + 1000) and can we add two pointers together (ptr1 + ptr2) and why/how. All this was an interactive session, where i was asked write the code for, in the code pair platform of Hackerrank.Then the interviewer moved on to Computer Architecture topic about little Endian and big Endian. I was asked to explain about them and then I was asked to draw an address map of a Hexadecimal number given by the interviewer in both little Endian and big Endian schemes. I was also asked to write a c++ function that checks whether any system is little endian or big endian. In the end, the interviewer moved on the computer networks and asked about IPv4 addresses. He then gave me c++ function to implement which takes 4 parameters which were IP1, IP2, Mask1, Mask2 , where IP1 and IP2 are ipv4 addresses of both networks and Mask1 and Mask2 are subnet masks of the both addresses. I had to implement a logic, whether both addresses belong to same network or not. I was able to implement a function for classfull addresses, but not for classless ones.The interview lasted for almost 2 hrs and I was able to answer almost all questions with little hints from the interviewer except the last one as I mentioned before.After the 2nd round, 5 students were shortlised for 3rd round, which happened to be mostly technical as well. Unfortunately, my name did make it to the third round and I felt very miserable at that point, since i felt like my 2nd round went pretty decent.<br><br>*FINAL RESULT: *The next day the results were announced, the everyone’s surprise I was one of the 4 selected students for the Intern + PPO role at Zscaler. Seemed like they had confirmed my selection after two rounds, and three other students were selected after the third round.<br><br>To summarise the process, the company mostly focused on CS fundamentals and in depth c++ knowledge. Some students were asked to explain their projects, and some easy DSA questions (depending on the interviewer as I was asked neither), but that was very rare."
  }
  